Revit 2026 API

# BuiltInFailuresConversionFailures Class

---

Failures about conversion of data to a different format.

SystemObject Autodesk.Revit.DBBuiltInFailuresConversionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ConversionFailures
```
```vb
Public NotInheritable Class ConversionFailures
```
```cpp
public ref class ConversionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ConversionFailures = class end
```

The BuiltInFailuresConversionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotConvertPercentToDouble | Cannot convert concentration percent ' [Percentage Value] ' to double value |
|  | CannotConvertTempToDouble | Cannot convert temperature '[Temperate Value]' to double value |
|  | CannotConvertToDouble | Cannot convert '[Text] ' to double value |
|  | UndefinedFluidUnit | Undefined fluid unit: '[Fluid Unit Type Name]' |
|  | UndefinedTemperatureUnit | Undefined temperature unit: '[Temperature Unit Type Name]' |

#### Reference

Autodesk.Revit.DB Namespace